07-rails/moma/app/controllers/artists_controller.rb

  def create
    artist = Artist.create artist_params
---
INSERT INTO "artists" ("name", "nationality", "period", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "jcioaj"], ["nationality", "dwq"], ["period", "mfewlk"], ["image", ""], ["created_at", "2019-04-16 06:00:34.262573"], ["updated_at", "2019-04-16 06:00:34.262573"]]

  def destroy
    artist = Artist.find params[:id]
    artist.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 8]]